app/controllers/admins_controller.rb

SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 0 LIMIT 1
---
  def show
    @admin = Admin.find(params[:id])