app/controllers/admins_controller.rb

  def index
    @rows=Link.all()
---
SELECT `links`.* FROM `links`

  def saveaccount
    @admin=getLoggedAdmin()
    if Admin.can_save_info(params[:username],@admin.id)
      setErrorMsg("There's already an administrator with the same given username.")
      redirect_to(:controller=>"admins",:action=>"account")
    else
     if (params[:oldpassword]!="" && Digest::SHA1.hexdigest(params[:oldpassword])!=@admin.password)
      setErrorMsg("Old password is incorrect.")
      redirect_to(:controller=>"admins",:action=>"account")
     else
       if params[:password]!=""
         @admin.password=Digest::SHA1.hexdigest(params[:password])
       end
       @admin.username=params[:username]
       Admin.update(@admin.id,:username => @admin.username,:password=>@admin.password)
---
UPDATE `admins` SET `username` = 'test', `password` = 'a94a8fe5ccb19ba61c4c0873d391e987982fbbd3'

  def show
    @rows = Admin.all
---
SELECT `admins`.* FROM `admins`

  def edit
    @admin = Admin.find(params[:id])
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 2 LIMIT 1

  def create
    if Admin.admin_exists(params[:username])
      setErrorMsg("There's already an administrator with the same given username.")
      redirect_to(:controller=>"admins",:action=>"new")
    end
    Admin.create(:username=>params[:username],:password=>Digest::SHA1.hexdigest(params[:password]))
---
INSERT INTO `admins` (`username`, `password`) VALUES ('test23', 'a94a8fe5ccb19ba61c4c0873d391e987982fbbd3')
INSERT INTO `users` (`email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `sign_in_count`, `current_sign_in_at`, `last_sign_in_at`, `current_sign_in_ip`, `last_sign_in_ip`, `created_at`, `updated_at`, `is_admin`) VALUES ('pasicmesud@gmail.com', '$2a$10$Jb1HyansY7.rfzlR0qi7muqsxbXQ6Ma0ZYAwkSirZSKqSI0EDQqY.', NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, '2011-06-23 11:45:52', '2011-06-23 11:45:52', 1)

  def update
    @admin = Admin.find(params[:id])
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 2 LIMIT 1

  def destroy
    @l=getLoggedAdmin()
    @admin = Admin.find(params[:id])
    if @l.id==@admin.id
      setErrorMsg("You cannot delete yourself")
    else
      @admin.destroy
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`id` = 1 LIMIT 1
DELETE FROM `admins` WHERE `admins`.`id` = 3