app/controllers/adminlogin_controller.rb

  def auth
    @admin=Admin.find_by_username_and_password(params[:username],Digest::SHA1.hexdigest(params[:password]))
---
SELECT `admins`.* FROM `admins` WHERE `admins`.`username` = 'test' AND `admins`.`password` = 'test' LIMIT 1