app/controllers/admins_controller.rb

  def show
    @rows = User.all
---
SELECT `users`.* FROM `users`

  def edit
    @admin = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1

  def destroy
    @l=getLoggedAdmin()
    @admin = User.find(params[:id])
    if @l.id==@admin.id
      flash[:alert]="You cannot delete yourself"
    else
      @admin.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 5