app/controllers/links_controller.rb

  def index
    @rows = Link.all
---
SELECT `links`.* FROM `links`

  def accept
    @link=Link.find(params[:id])
---
SELECT `links`.* FROM `links` WHERE `links`.`id` = 1 LIMIT 1

  def parse
    @link=Link.find(params[:id])
---
SELECT `links`.* FROM `links` WHERE `links`.`id` = 1 LIMIT 1

  def create
    @link = Link.new(:link=>params[:link],:status=>1,:parsed=>params[:parsed].to_i)
      if @link.save
---
INSERT INTO `links` (`link`, `status`, `parsed`) VALUES ('http://feeds.huffingtonpost.com/HP/MostPopular', 1, NULL)