app/controllers/posts_controller.rb

  def index
    @rows = Post.all
---
SELECT `posts`.* FROM `posts`

  def delete
    @post = Post.find(params[:id])
    if @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 39 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 39